``` Terraform will perform the following actions:

  # aws_route53_record.celery-galaxyproject must be replaced
  # (moved from aws_route53_record.celery-galaxyproject[0])
-/+ resource "aws_route53_record" "celery-galaxyproject" {
      ~ fqdn            = "celery-0.galaxyproject.eu" -> (known after apply)
      ~ id              = "Z386N8B8JBC6TQ_celery-0.galaxyproject.eu_A" -> (known after apply)
      ~ name            = "celery-0.galaxyproject.eu" -> "celery-1.galaxyproject.eu" # forces replacement
      ~ records         = [
          + "10.4.68.198",
          - "10.5.67.216",
        ]
        # (4 unchanged attributes hidden)
    }

  # openstack_networking_secgroup_rule_v2.interactive-egress-internal-network will be created
  + resource "openstack_networking_secgroup_rule_v2" "interactive-egress-internal-network" {
      + direction         = "egress"
      + ethertype         = "IPv4"
      + id                = (known after apply)
      + port_range_max    = (known after apply)
      + port_range_min    = (known after apply)
      + protocol          = (known after apply)
      + region            = (known after apply)
      + remote_group_id   = (known after apply)
      + remote_ip_prefix  = "10.0.0.0/8"
      + security_group_id = "2df98248-0b6a-4763-90a8-e77a859d2457"
      + tenant_id         = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan" ```